cask_args appdir: "/Applications"

tap "caius/es101"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/versions"

brew "zsh"
brew "z"
brew "zsh-syntax-highlighting"
brew "git"
brew "gnutls"

cask "java"
cask "launchbar"
cask "font-liberation-sans"
cask "textmate"

brew "openssl"
brew "libyaml"
brew "libxslt"
brew "autoconf"
brew "automake"
brew "chruby"
brew "ruby-install"

brew "coreutils"
brew "csshx"
brew "dnsmasq"
brew "dos2unix"
brew "gnu-sed"
brew "gnu-time"
brew "gnupg"
brew "jq"
brew "links"
brew "lynx"
brew "proctools"
brew "psgrep"
brew "pstree"
brew "pwgen"
brew "python"
brew "renameutils"
brew "shellcheck"
brew "the_silver_searcher"
brew "tree"
brew "wakeonlan"
brew "watch"
brew "wdiff"
brew "wget"
brew "youtube-dl"

# Require full Xcode
brew "blueutil"
brew "mas", args: %w(--HEAD)

brew "imagemagick"
brew "optipng"
brew "pngcrush"
brew "elasticsearch15", restart_service: :changed
brew "mariadb100", restart_service: :changed
brew "v8-315"
brew "tinyproxy"
brew "s3cmd"
brew "memcached", restart_service: :changed

# Workarounds on Sierra
brew "erlang", args: %w(--without-wxmac)
brew "xz"
brew "rabbitmq", args: %w(--ignore-dependencies)

# brew "qt"

cask "blockblock"
cask "spectacle"
# cask "menumeters" # install yujitach-menumeters?
cask "cyberduck"
cask "dropbox"
cask "flux"
cask "gitx"
cask "google-drive"
cask "macdown"
cask "mou"
cask "screenhero"
cask "things"
cask "vmware-fusion"
cask "viscosity"
cask "charles"

cask "betterzipql"
cask "epubquicklook"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "scriptql"
cask "suspicious-package"
cask "webpquicklook"

mas "Letterpress", id: 1070543522
mas "Numbers", id: 409203825
mas "LimeChat", id: 414030210
mas "1Password", id: 443987910
mas "NetNewsWire", id: 635060292
mas "Evernote", id: 406056744
mas "Slack", id: 803453959
mas "HTTP Client", id: 418138339
mas "Fitness Converter", id: 1057621416
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 557168941
